import React from 'react';
import './style.scss'



const Services = () => {
    const servicesList = [
        {
            title: 'Групповые и индивидуальные туры',
            description: 'Откройте для себя уникальные места в компании наших экспертов-гидов.' +
                'Исследуйте удивительные пейзажи и культуру в компании профессиональных гидов. ' +
                'Путешествуйте в удобной и безопасной атмосфере с нашими групповыми и индивидуальными турами.',
            img: 'https://www.svoiludi.ru/images/tb/15408/gruppovye-tury-po-rossii-16790700952586_w687h357.jpg'
        },
        {
            title: 'Бронирование отелей и аренда жилья',
            description: 'Выбирайте из широкого спектра вариантов размещения по всему Кыргызстану.' +
                'Наслаждайтесь комфортом и уютом в наших отелях и апартаментах по доступным ценам.' +
                'Проведите незабываемый отпуск, выбрав подходящее жилье из нашего каталога.' +
                'Почувствуйте себя как дома, арендуя уютное жилье на любой вкус и бюджет.',
            img: 'https://www.biletik.aero/upload/iblock/587/5873297e836145f0ce250720a320be8f.jpg'
        },
        {
            title: 'Транспортные услуги',
            description: 'Аренда автомобилей, мотоциклов, велосипедов для вашего удобства.' +
                'Исследуйте Кыргызстан на полной скорости, арендуя транспортное средство у нас.' +
                'Путешествуйте без забот об общественном транспорте, взяв в аренду удобный автомобиль или мотоцикл.' +
                'У нас вы найдете большой выбор транспортных средств для комфортного передвижения по всей стране.',
            img: 'https://vodiauto.ru/wp-content/uploads/2021/06/arenda-avto-aeroport.jpg'
        },
        {
            title: 'Гастрономические туры',
            description: 'Познакомьтесь с богатством кыргызской кухни и посетите лучшие рестораны.' +
                'Откройте для себя вкусы и ароматы кыргызской кухни вместе с нами.' +
                'Проведите незабываемое путешествие, наслаждаясь великолепными блюдами и напитками Кыргызстана.' +
                'Погрузитесь в мир гастрономических открытий, выбрав один из наших туров по кулинарным достопримечательностям.',
            img: 'https://reciple.kz/images/bluda/kaz_kuhnia/besbarmak.jpg'
        },
        {
            title: 'Пешие прогулки по горным тропам',
            description: 'Погрузитесь в мир горных пейзажей и неповторимой природы Кыргызстана.' +
                'Путешествуйте пешком по живописным тропам в сопровождении наших опытных гидов.' +
                'Ощутите вдохновение и умиротворение, наслаждаясь природными красотами наших гор.',
            img: 'https://triptokyrgyzstan.com/sites/default/files/media/image/7881198944_1a87f9c3f8_b_0.jpg'
        },
        {
            title: 'Посещение музеев и культурных событий',
            description: 'Исследуйте богатую историю и культуру Кыргызстана.' +
                'Погрузитесь в мир искусства и истории, посещая музеи и культурные мероприятия страны.' +
                'Путешествуйте во времени, ознакомившись с артефактами и традициями кыргызского народа.' +
                'Откройте для себя удивительные исторические и культурные достопримечательности, выбрав наши туры.',
            img: 'https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTmg_2vYf5eFFd491Ksq7bA9KP-Q-u6iDCuOg&usqp=CAU'
        },
        {
            title: 'Путеводительские услуги',
            description: 'Наши гиды помогут вам максимально использовать ваше путешествие.' +
                'Откройте для себя скрытые жемчужины Кыргызстана вместе с нашими опытными гидами.' +
                'Погрузитесь в мир истории, культуры и природы под руководством профессиональных экскурсоводов.' +
                'Получите уникальный опыт путешествия, следуя за нашими экспертами по маршрутам.',
            img: 'https://www.toptr.ru/assets/image-cache/media/images/%D0%93%D0%B8%D0%B4%D0%9F%D0%B5%D1%80%D0%B5%D0%B2%D0%BE%D0%B4%D1%87%D0%B8%D0%BA.a92b6d74.jpg'
        },
        {
            title: 'Фотосессии в путешествиях',
            description: 'Запечатлейте ваши воспоминания с нашими профессиональными фотографами.' +
                'Создайте потрясающие фотографии на фоне красивых пейзажей Кыргызстана.' +
                'Сделайте свое путешествие незабываемым, оставив яркие воспоминания в фотографиях.' +
                'Получите уникальные снимки ваших приключений вместе с нашими опытными фотографами.',
            img: 'https://cdn.tripzaza.com/ru/destinations/wp-content/uploads/2018/06/Dostoprimechatelnosti-Kirgizii-e1528640117864.jpg'
        }
    ];

    return (
        <div id='services'>
            <div className="container">
                <div className="services">
                    <h2>Наши услуги</h2>
                    <h4>
                        Мы предоставляем широкий спектр услуг для того, <br/>
                        чтобы сделать ваше путешествие по Кыргызстану незабываемым.
                    </h4>

                    <div className="services--list">

                        {servicesList.map((service, index) => (
                                    <div className="services--list__service" key={index}>

                                        <img src={service.img} alt=""/>
                                        <div className='services--list__service--title'>
                                            <h3>{service.title}</h3>
                                            <p>{service.description}</p>
                                        </div>

                                    </div>
                        ))}
                    </div>
                </div>
            </div>
        </div>
    );
};

export default Services;
